---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementAssignedToDefaultSystem
source: html/024e7008-f97f-bbce-1332-24248e552828.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementAssignedToDefaultSystem Property

At least one connector on the highlighted element is currently assigned to the [Element Name]. In general items shouldn't be assigned to the Default Systems, but should be assigned as equipments or elements of a non-default system. Click the More Info button below for additional information on System Creation.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementAssignedToDefaultSystem { get; }
```